; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	satellite5 - satellite
	instrument7 - instrument
	instrument8 - instrument
	infrared2 - mode
	image1 - mode
	infrared0 - mode
	image3 - mode
	Star3 - direction
	Star4 - direction
	Star2 - direction
	Star0 - direction
	GroundStation1 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star0)
	(supports instrument2 image3)
	(calibration_target instrument2 Star2)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star4)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star0)
	(supports instrument5 infrared2)
	(supports instrument5 image3)
	(supports instrument5 infrared0)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon8)
	(supports instrument6 infrared2)
	(supports instrument6 image1)
	(supports instrument6 infrared0)
	(calibration_target instrument6 Star2)
	(on_board instrument6 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon11)
	(supports instrument7 infrared0)
	(supports instrument7 infrared2)
	(calibration_target instrument7 Star0)
	(supports instrument8 image1)
	(calibration_target instrument8 GroundStation1)
	(on_board instrument7 satellite5)
	(on_board instrument8 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Phenomenon10)
)
(:goal (and
	(pointing satellite0 Planet9)
	(pointing satellite1 Planet9)
	(pointing satellite4 Star4)
	(pointing satellite5 GroundStation1)
	(have_image Planet5 image3)
	(have_image Phenomenon6 infrared2)
	(have_image Planet7 image3)
	(have_image Phenomenon8 image1)
	(have_image Planet9 image1)
	(have_image Phenomenon10 infrared0)
	(have_image Phenomenon11 infrared0)
	(have_image Planet12 image1)
))

)

; plan
1. (turn_to satellite5 groundstation1 phenomenon10)
   deleted: (pointing satellite5 phenomenon10)
   added: (pointing satellite5 groundstation1)
   goals met: 1 of 12
2. (turn_to satellite4 star4 phenomenon11)
   deleted: (pointing satellite4 phenomenon11)
   added: (pointing satellite4 star4)
   goals met: 2 of 12
3. (turn_to satellite3 groundstation1 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 groundstation1)
   goals met: 2 of 12
4. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 2 of 12
5. (calibrate satellite3 instrument5 groundstation1)
   added: (calibrated instrument5)
   goals met: 2 of 12
6. (turn_to satellite3 phenomenon10 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 phenomenon10)
   goals met: 2 of 12
7. (turn_to satellite1 planet9 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet9)
   goals met: 3 of 12
8. (turn_to satellite0 star2 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star2)
   goals met: 3 of 12
9. (take_image satellite3 phenomenon10 instrument5 infrared0)
   added: (have_image phenomenon10 infrared0)
   goals met: 4 of 12
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 12
11. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 4 of 12
12. (turn_to satellite0 phenomenon8 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon8)
   goals met: 4 of 12
13. (take_image satellite0 phenomenon8 instrument0 image1)
   added: (have_image phenomenon8 image1)
   goals met: 5 of 12
14. (turn_to satellite0 planet12 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet12)
   goals met: 5 of 12
15. (take_image satellite0 planet12 instrument0 image1)
   added: (have_image planet12 image1)
   goals met: 6 of 12
16. (turn_to satellite0 planet9 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet9)
   goals met: 7 of 12
17. (take_image satellite0 planet9 instrument0 image1)
   added: (have_image planet9 image1)
   goals met: 8 of 12
18. (turn_to satellite3 phenomenon11 phenomenon10)
   deleted: (pointing satellite3 phenomenon10)
   added: (pointing satellite3 phenomenon11)
   goals met: 8 of 12
19. (take_image satellite3 phenomenon11 instrument5 infrared0)
   added: (have_image phenomenon11 infrared0)
   goals met: 9 of 12
20. (turn_to satellite3 phenomenon6 phenomenon11)
   deleted: (pointing satellite3 phenomenon11)
   added: (pointing satellite3 phenomenon6)
   goals met: 9 of 12
21. (take_image satellite3 phenomenon6 instrument5 infrared2)
   added: (have_image phenomenon6 infrared2)
   goals met: 10 of 12
22. (turn_to satellite3 planet5 phenomenon6)
   deleted: (pointing satellite3 phenomenon6)
   added: (pointing satellite3 planet5)
   goals met: 10 of 12
23. (take_image satellite3 planet5 instrument5 image3)
   added: (have_image planet5 image3)
   goals met: 11 of 12
24. (turn_to satellite3 planet7 planet5)
   deleted: (pointing satellite3 planet5)
   added: (pointing satellite3 planet7)
   goals met: 11 of 12
25. (take_image satellite3 planet7 instrument5 image3)
   added: (have_image planet7 image3)
   goals met: 12 of 12
